IDEA Open Model
OpenMessages Class
 Open messages collection
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Message.OpenMessages
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class OpenMessages
Public Class OpenMessages
public ref class OpenMessages
The OpenMessages type exposes the following members.
Constructors
Name | Description
OpenMessages
 Constructor
Top
Properties
Name | Description
ErrorMessages
 List Error messages only
InformationMessages
 List Information messages only
Messages
 List of messages
WarningMessages
 List Worning messages only
Top
Methods
Name | Description
Add
 Add a message
Top
See Also
Reference
IdeaRS.OpenModel.Message Namespace